marcelkottmann/esp32-javascript/components/socket-events/socket-events.c
/*
MIT License

Copyright (c) 2020 Marcel Kottmann

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE.
*/

#include "socket-events.h"
#include <openssl/ssl.h>
#include <mbedtls/ssl.h>
#include <mbedtls/compat-1.3.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include "esp_log.h"
#include "tcp.h"
#include "esp32-javascript.h"
#include "esp32-js-log.h"

TaskHandle_t stask;
int notConnectedSockets_len = 0;
int *notConnectedSockets = NULL;
int connectedSockets_len = 0;
int *connectedSockets = NULL;
int connectedWritableSockets_len = 0;
int *connectedWritableSockets = NULL;
int selectClientSocket = -1;
int selectServerSocket = -1;
SemaphoreHandle_t xSemaphore;
bool needsUnblock = false;
struct sockaddr_in target;

extern const uint8_t cacert_pem_start[] asm("_binary_cacert_pem_start");
extern const uint8_t cacert_pem_end[] asm("_binary_cacert_pem_end");

extern const uint8_t prvtkey_pem_start[] asm("_binary_prvtkey_pem_start");
extern const uint8_t prvtkey_pem_end[] asm("_binary_prvtkey_pem_end");

int createSocketPair()
{
    struct sockaddr_in server;

    jslog(DEBUG, "Start creating socket paair\n");
    /*int bits = xEventGroupGetBits(wifi_event_group);
    int connected = CONNECTED_BIT & bits;
*/
    int connected = 1;
    if (connected)
    {
        int sd = createNonBlockingSocket(AF_INET, SOCK_DGRAM, 0, true);
        if (sd >= 0)
        {
            int port = 6789;
            memset((char *)&server, 0, sizeof(server));
            server.sin_family = AF_INET;
            server.sin_addr.s_addr = htonl(INADDR_ANY);
            server.sin_port = htons(port);
            server.sin_len = sizeof(server);

            jslog(DEBUG, "Trying to bind socket %d...\n", sd);

            if (bind(sd, (struct sockaddr *)&server, sizeof(server)) >= 0)
            {
                jslog(DEBUG, "Trying to create client socket...\n");

                int sc = createNonBlockingSocket(AF_INET, SOCK_DGRAM, 0, true);

                jslog(DEBUG, "Created socket pair: %d<-->%d\n", sd, sc);

                jslog(DEBUG, "Send test data...\n");

                memset((char *)&target, 0, sizeof(target));
                target.sin_family = AF_INET;
                target.sin_port = htons(port);
                target.sin_len = sizeof(target);
                inet_pton(AF_INET, "127.0.0.1", &(target.sin_addr));

                if (sendto(sc, "", 1, 0, (struct sockaddr *)&target, sizeof(target)) < 0)
                {
                    jslog(ERROR, "Error sending test data to self-socket: %d\n", errno);
                }
                else
                {
                    jslog(DEBUG, "Trying to receive test data...\n");
                    char msg[2] = "A";
                    struct sockaddr_in remaddr;
                    socklen_t addrlen = sizeof(remaddr);

                    int result = 0;
                    while ((result = recvfrom(sd, msg, 1, 0, (struct sockaddr *)&remaddr, &addrlen)) < 0 && errno == EAGAIN)
                    {
                    }

                    while (result < 0)
                    {
                        jslog(ERROR, "Error receiving test data from self-socket: %d\n", errno);
                    }
                    jslog(DEBUG, "Finished reading.\n");

                    if (strcmp(msg, "") == 0)
                    {
                        jslog(INFO, "Self-Socket Test successful!\n");

                        selectClientSocket = sc;
                        selectServerSocket = sd;
                        jslog(DEBUG, "Successfully created socket pair: %d<-->%d\n", selectServerSocket, selectClientSocket);
                        return 0;
                    }
                    else
                    {
                        jslog(ERROR, "Self-socket test NOT successful: %s\n", msg);
                    }
                }
                close(sc);
            }
            else
            {
                jslog(ERROR, "Binding self-socket was unsuccessful: %d\n", errno);
            }

            close(sd);
        }
        else
        {
            jslog(ERROR, "Self-socket could not be created: %d", errno);
        }
    }
    else
    {
        jslog(DEBUG, "Skip until wifi connected: %d\n", errno);
    }

    jslog(DEBUG, "Could not create socket pair... no wifi?\n");
    return -1;
}

void select_task_it()
{

    // create socket pair
    if (selectServerSocket < 0)
    {
        createSocketPair();
    }

    if (selectServerSocket >= 0 && (notConnectedSockets_len + connectedSockets_len + connectedWritableSockets_len) > 0)
    {
        fd_set readset;
        fd_set writeset;
        fd_set errset;

        int sockfd_max = -1;
        FD_ZERO(&readset);
        FD_ZERO(&writeset);
        FD_ZERO(&errset);

        //register not connected sockets for write ready event
        for (int i = 0; i < notConnectedSockets_len; i++)
        {
            int sockfd = notConnectedSockets[i];
            FD_SET(sockfd, &writeset);
            FD_SET(sockfd, &errset);
            if (sockfd > sockfd_max)
            {
                sockfd_max = sockfd;
            }
        }

        //register connected sockets for read ready event
        for (int i = 0; i < connectedSockets_len; i++)
        {
            int sockfd = connectedSockets[i];
            FD_SET(sockfd, &readset);
            FD_SET(sockfd, &errset);
            if (sockfd > sockfd_max)
            {
                sockfd_max = sockfd;
            }
        }

        //register connected sockets which have an onWritable callback
        for (int i = 0; i < connectedWritableSockets_len; i++)
        {
            int sockfd = connectedWritableSockets[i];
            FD_SET(sockfd, &writeset);
            if (sockfd > sockfd_max)
            {
                sockfd_max = sockfd;
            }
        }

        //set self-socket flag
        //reset (read all data) from self socket
        int dataAvailable;
        if (lwip_ioctl(selectServerSocket, FIONREAD, &dataAvailable) < 0)
        {
            jslog(ERROR, "Error getting data available from self-socket: %d.", errno);
        }
        jslog(DEBUG, "DATA AVAILABLE %d.\n", dataAvailable);
        //read self-socket if flag is set
        if (dataAvailable > 0)
        {
            char msg[dataAvailable];
            struct sockaddr_in remaddr;
            socklen_t addrlen = sizeof(remaddr);
            if (recvfrom(selectServerSocket, msg, dataAvailable, 0, (struct sockaddr *)&remaddr, &addrlen) < 0)
            {
                jslog(ERROR, "READ self-socket FAILED: %d\n", errno);
            }
            else
            {
                jslog(DEBUG, "READ of self-socket.\n");
            }
        }

        FD_SET(selectServerSocket, &readset);
        if (selectServerSocket > sockfd_max)
        {
            sockfd_max = selectServerSocket;
        }
        // self socket end
        int ret = select(sockfd_max + 1, &readset, &writeset, &errset, NULL);
        needsUnblock = true;
        jslog(DEBUG, "Select return %d.\n", ret);
        if (ret >= 0)
        {
            if (ret > 0)
            {
                js_eventlist_t events;
                events.events_len = 0;

