marcelkottmann/esp32-javascript/components/socket-events/socket-events.c
                for (int i = 0; i < notConnectedSockets_len; i++)
                {
                    int sockfd = notConnectedSockets[i];
                    if (FD_ISSET(sockfd, &errset))
                    {
                        js_event_t event;
                        el_create_event(&event, EL_SOCKET_EVENT_TYPE, EL_SOCKET_STATUS_ERROR, (void *)sockfd);
                        el_add_event(&events, &event);
                    }
                    else if (FD_ISSET(sockfd, &writeset))
                    {
                        js_event_t event;
                        el_create_event(&event, EL_SOCKET_EVENT_TYPE, EL_SOCKET_STATUS_WRITE, (void *)sockfd);
                        el_add_event(&events, &event);
                    }
                }
                for (int i = 0; i < connectedSockets_len; i++)
                {
                    int sockfd = connectedSockets[i];
                    if (FD_ISSET(sockfd, &errset))
                    {
                        js_event_t event;
                        el_create_event(&event, EL_SOCKET_EVENT_TYPE, EL_SOCKET_STATUS_ERROR, (void *)sockfd);
                        el_add_event(&events, &event);
                    }
                    else if (FD_ISSET(sockfd, &readset))
                    {
                        js_event_t event;
                        el_create_event(&event, EL_SOCKET_EVENT_TYPE, EL_SOCKET_STATUS_READ, (void *)sockfd);
                        el_add_event(&events, &event);
                    }
                    else if (FD_ISSET(sockfd, &writeset))
                    {
                        js_event_t event;
                        el_create_event(&event, EL_SOCKET_EVENT_TYPE, EL_SOCKET_STATUS_WRITE, (void *)sockfd);
                        el_add_event(&events, &event);
                    }
                }

                if (events.events_len > 0)
                {
                    jslog(DEBUG, "Fire all %d socket events!\n", events.events_len);
                    el_fire_events(&events);
                }
                else
                {
                    jslog(DEBUG, "No socket events to fire!\n");
                }
            }
        }
        else
        {
            jslog(ERROR, "select returns ERROR: %d\n", errno);
        }
    }
    //wait for next loop
    needsUnblock = true;
    jslog(DEBUG, "Select loop finished and now waits for next iteration.\n");
    xSemaphoreTake(xSemaphore, portMAX_DELAY);
    needsUnblock = false;
}

static duk_ret_t el_registerSocketEvents(duk_context *ctx)
{
    int c_len, nc_len, cw_len;
    int *c_sockfds;
    int *nc_sockfds;
    int *cw_sockfds;

    //not connected sockets
    if (duk_is_array(ctx, 0))
    {
        nc_len = duk_get_length(ctx, 0);
        nc_sockfds = (int *)calloc(nc_len, sizeof(int));
        for (int i = 0; i < nc_len; i++)
        {
            duk_get_prop_index(ctx, 0, i);
            nc_sockfds[i] = duk_to_int(ctx, -1);
            duk_pop(ctx);
        }
    }
    else
    {
        //error
        return -1;
    }

    //connected sockets
    if (duk_is_array(ctx, 1))
    {
        c_len = duk_get_length(ctx, 1);
        c_sockfds = (int *)calloc(c_len, sizeof(int));
        for (int i = 0; i < c_len; i++)
        {
            duk_get_prop_index(ctx, 1, i);
            c_sockfds[i] = duk_to_int(ctx, -1);
            duk_pop(ctx);
        }
    }
    else
    {
        //error
        return -1;
    }

    //connected and registered for writable events
    if (duk_is_array(ctx, 2))
    {
        cw_len = duk_get_length(ctx, 2);
        cw_sockfds = (int *)calloc(cw_len, sizeof(int));
        for (int i = 0; i < cw_len; i++)
        {
            duk_get_prop_index(ctx, 2, i);
            cw_sockfds[i] = duk_to_int(ctx, -1);
            duk_pop(ctx);
        }
    }
    else
    {
        //error
        return -1;
    }

    //check if there are changes between this and the previous call
    bool changes = c_len != connectedSockets_len ||
                   nc_len != notConnectedSockets_len ||
                   cw_len != connectedWritableSockets_len;

    //deep check
    if (!changes)
    {
        for (int i = 0; i < nc_len; i++)
        {
            if (notConnectedSockets[i] != nc_sockfds[i])
            {
                changes = true;
                break;
            }
        }
        if (!changes)
        {
            for (int i = 0; i < c_len; i++)
            {
                if (connectedSockets[i] != c_sockfds[i])
                {
                    changes = true;
                    break;
                }
            }
        }
        if (!changes)
        {
            for (int i = 0; i < cw_len; i++)
            {
                if (connectedWritableSockets[i] != cw_sockfds[i])
                {
                    changes = true;
                    break;
                }
            }
        }
    }

    if (changes)
    {
        //swap
        free(notConnectedSockets);
        notConnectedSockets_len = nc_len;
        notConnectedSockets = nc_sockfds;

        free(connectedSockets);
        connectedSockets_len = c_len;
        connectedSockets = c_sockfds;

        free(connectedWritableSockets);
        connectedWritableSockets_len = cw_len;
        connectedWritableSockets = cw_sockfds;
    }
    else
    {
        free(nc_sockfds);
        free(c_sockfds);
        free(cw_sockfds);
    }

    if (changes)
    {
        jslog(DEBUG, "Trying to trigger the next select iteration... ");
        if (selectClientSocket >= 0)
        {
            //interrupt select through self-socket
            jslog(DEBUG, "Sending . to self-socket.");
            needsUnblock = true;
            if (sendto(selectClientSocket, ".", 1, 0, (struct sockaddr *)&target, sizeof(target)) < 0)
            {
                jslog(ERROR, "Self-socket sending was NOT successful: %d\n", errno);
            }
            else
            {
                jslog(DEBUG, "Self-socket sending was successful.\n");
            }
        }
    }

    //trigger next select loop
    if (needsUnblock)
    {
        xSemaphoreGive(xSemaphore);
    }

