marcelkottmann/esp32-javascript/components/socket-events/socket-events.c
    SSL *ssl = createSSL(sslCtx);

    if (!duk_is_undefined(ctx, 1))
    {
        const char *hostname = duk_to_string(ctx, 1);
        SSL_set_tlsext_host_name(ssl, hostname);
    }

    duk_push_int(ctx, (duk_int_t)ssl);
    return 1;
}

void initSocketFunctions(duk_context *ctx)
{
    duk_push_c_function(ctx, writeSocket_bind, 5 /*nargs*/);
    duk_put_global_string(ctx, "writeSocket");

    duk_push_c_function(ctx, el_readSocket, 2 /*nargs*/);
    duk_put_global_string(ctx, "readSocket");

    duk_push_c_function(ctx, el_closeSocket, 1 /*nargs*/);
    duk_put_global_string(ctx, "el_closeSocket");

    duk_push_c_function(ctx, el_createNonBlockingSocket, 0 /*nargs*/);
    duk_put_global_string(ctx, "el_createNonBlockingSocket");

    duk_push_c_function(ctx, el_connectNonBlocking, 3 /*nargs*/);
    duk_put_global_string(ctx, "el_connectNonBlocking");

    duk_push_c_function(ctx, el_bindAndListen, 2 /*nargs*/);
    duk_put_global_string(ctx, "el_bindAndListen");

    duk_push_c_function(ctx, el_acceptIncoming, 1 /*nargs*/);
    duk_put_global_string(ctx, "el_acceptIncoming");

    duk_push_c_function(ctx, el_registerSocketEvents, 3 /*nargs*/);
    duk_put_global_string(ctx, "el_registerSocketEvents");

    duk_push_c_function(ctx, el_createSSLServerContext, 0);
    duk_put_global_string(ctx, "createSSLServerContext");

    duk_push_c_function(ctx, el_createSSLClientContext, 0);
    duk_put_global_string(ctx, "createSSLClientContext");

    duk_push_c_function(ctx, el_createSSL, 2);
    duk_put_global_string(ctx, "createSSL");

    duk_push_c_function(ctx, acceptSSL, 2);
    duk_put_global_string(ctx, "acceptSSL");

    duk_push_c_function(ctx, connectSSL, 2);
    duk_put_global_string(ctx, "connectSSL");

    duk_push_c_function(ctx, shutdownSSL, 1);
    duk_put_global_string(ctx, "shutdownSSL");

    duk_push_c_function(ctx, freeSSL, 1);
    duk_put_global_string(ctx, "freeSSL");

    duk_push_c_function(ctx, el_getsockopt, 1);
    duk_put_global_string(ctx, "el_getsockopt");

    duk_push_int(ctx, EL_SOCKET_EVENT_TYPE);
    duk_put_global_string(ctx, "EL_SOCKET_EVENT_TYPE");

    xSemaphore = xSemaphoreCreateBinary();

    xTaskCreatePinnedToCore(&select_task, "select_task", 12 * 1024, NULL, 5, &stask, 0);
}